In [2]:
import pandas as pd

df = pd.read_csv('data.csv')

print(f'SHape of the data is {df.shape} ------- and first five entries are: \n\n{df.head()}')

SHape of the data is (105, 5) ------- and first five entries are:

  experience  job_desig   location  salary  placement_count
0    2-4 yrs  Analytics     Mumbai   6to10             4479
1   5-10 yrs  Analytics  Delhi NCR   6to10             1969
2    3-8 yrs     Growth     Mumbai  15to25             3319
3    2-6 yrs  Analytics  Bengaluru   6to10              330
4    6-8 yrs  Analytics  Delhi NCR  25to50             2665

In [12]:
df = pd.read_csv('data.csv', sep = ',')

print(f'SHape of the data is {df.shape} ------- and first five entries are: \n\n{df.head()}')

SHape of the data is (105, 5) ------- and first five entries are:

  experience  job_desig   location  salary  placement_count
0    2-4 yrs  Analytics     Mumbai   6to10             4479
1   5-10 yrs  Analytics  Delhi NCR   6to10             1969
2    3-8 yrs     Growth     Mumbai  15to25             3319
3    2-6 yrs  Analytics  Bengaluru   6to10              330
4    6-8 yrs  Analytics  Delhi NCR  25to50             2665

In [13]:
df = pd.read_csv('data.csv', sep = ',', names= ['A','B','C','D','E'])

print(f'SHape of the data is {df.shape} ------- and first five entries are: \n\n{df.head()}')

SHape of the data is (106, 5) ------- and first five entries are:

            A          B          C       D                E
0  experience  job_desig   location  salary  placement_count
1     2-4 yrs  Analytics     Mumbai   6to10             4479
2    5-10 yrs  Analytics  Delhi NCR   6to10             1969
3     3-8 yrs     Growth     Mumbai  15to25             3319
4     2-6 yrs  Analytics  Bengaluru   6to10              330

In [15]:
df = pd.read_csv('data.csv', header= None, names= ['A','B','C','D','E'])

print(f'SHape of the data is {df.shape} ------- and first five entries are: \n\n{df.head()}')

SHape of the data is (106, 5) ------- and first five entries are:

            A          B          C       D                E
0  experience  job_desig   location  salary  placement_count
1     2-4 yrs  Analytics     Mumbai   6to10             4479
2    5-10 yrs  Analytics  Delhi NCR   6to10             1969
3     3-8 yrs     Growth     Mumbai  15to25             3319
4     2-6 yrs  Analytics  Bengaluru   6to10              330

In [20]:
df = pd.read_csv('data_skip.csv', skiprows=6)

print(df.shape)

df.head()

(105, 5)

  experience  job_desig   location  salary  placement_count
0    2-4 yrs  Analytics     Mumbai   6to10             4479
1   5-10 yrs  Analytics  Delhi NCR   6to10             1969
2    3-8 yrs     Growth     Mumbai  15to25             3319
3    2-6 yrs  Analytics  Bengaluru   6to10              330
4    6-8 yrs  Analytics  Delhi NCR  25to50             2665

In [23]:
df = pd.read_csv('data_skipcolumn.csv')

print(df.shape)

df.head()

(107, 9)

   experience  Unnamed: 1  Unnamed: 2  Unnamed: 3  Unnamed: 4  job_desig   location  salary  placement_count
0         NaN         NaN         NaN         NaN         NaN        NaN        NaN     NaN              NaN
1  experience         NaN         NaN         NaN         NaN  job_desig   location  salary  placement_count
2     2-4 yrs         NaN         NaN         NaN         NaN  Analytics     Mumbai   6to10             4479
3    5-10 yrs         NaN         NaN         NaN         NaN  Analytics  Delhi NCR   6to10             1969
4     3-8 yrs         NaN         NaN         NaN         NaN     Growth     Mumbai  15to25             3319

In [27]:
df = df.loc[:, ~df.columns.str.contains('^Unnamed')]

print(df.shape)

df.head()

(107, 5)

   experience  job_desig   location  salary  placement_count
0         NaN        NaN        NaN     NaN              NaN
1  experience  job_desig   location  salary  placement_count
2     2-4 yrs  Analytics     Mumbai   6to10             4479
3    5-10 yrs  Analytics  Delhi NCR   6to10             1969
4     3-8 yrs     Growth     Mumbai  15to25             3319

In [29]:
df = pd.read_csv('data_skipcolumn.csv',usecols= ['experience','job_desig','location','salary','placement_count'])

print(df.shape)

df.head()

(107, 5)

   experience  job_desig   location  salary  placement_count
0         NaN        NaN        NaN     NaN              NaN
1  experience  job_desig   location  salary  placement_count
2     2-4 yrs  Analytics     Mumbai   6to10             4479
3    5-10 yrs  Analytics  Delhi NCR   6to10             1969
4     3-8 yrs     Growth     Mumbai  15to25             3319

In [46]:
df = pd.read_csv('data.txt',sep='\t')
df.shape
df.head()

   job_desig   location  salary
0  Analytics     Mumbai   6to10
1  Analytics  Delhi NCR   6to10
2     Growth     Mumbai  15to25
3  Analytics  Bengaluru   6to10
4  Analytics  Delhi NCR  25to50

In [56]:
df = pd.read_excel('data.xlsx',sheet_name=1)

for sheets in range(2):
    
    df = pd.read_excel('data.xlsx',sheet_name=sheets)
    print(f'shape of the dataset {sheets+1} is {df.shape}')

shape of the dataset 1 is (0, 0)
shape of the dataset 2 is (100, 5)

In [11]:
import pandas as pd

df = pd.read_excel('data.xlsx',usecols=['Topic','Staged_At'], sheet_name = 1, nrows=30)
df.shape
df.head()

                                           Topic       Staged_At
0  The birds and the bees are just the beginning  TEDGlobal 2013
1                              Software (as) art         TED2004
2           A preview of the WorldWide Telescope         TED2008
3                    How to restore a rainforest         TED2009
4     How cyberattacks threaten real-world peace  TEDxParis 2010

In [13]:
df = pd.read_excel('data.xlsx', sheet_name = 1,nrows=30,skiprows=20,header=None,names=['21.1','21.2','21.3','21.4','21.5'])
df.shape
df.head()

,21.1,21.2,21.3,21.4,21.5
0,Shilo Shiv Suleman,Using tech to enable dreaming,INK Conference,0:07:36,13.259940
1,Frank Gehry,"A master architect asks, Now what?",TED2002,0:22:00,13.763936
2,Jonathan Drori,The beautiful tricks of flowers,TEDSalon London Spring 2011,0:13:48,13.742830
3,Caroline Phillips,Hurdy-gurdy for beginners,TEDGlobal 2010,0:05:41,13.354143
4,Vishal Vaid,Hypnotic South Asian improv music,TED2006,0:13:34,12.926978

In [30]:
df = pd.read_excel('student_placement.xlsx')
df.head()
s = df.shape
print(s)
print(f'Rows count ---> {s[0]} and Column count ---> {s[1]}')
print()

print(df.info())
print(df.describe())

print()

print(df.columns)

(105, 5)
Rows count ---> 105 and Column count ---> 5

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 105 entries, 0 to 104
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   experience       105 non-null    object
 1   job_desig        105 non-null    object
 2   location         105 non-null    object
 3   salary           105 non-null    object
 4   placement_count  105 non-null    int64
dtypes: int64(1), object(4)
memory usage: 4.2+ KB
None
       placement_count
count       105.000000
mean       2183.628571
std        1374.740222
min          16.000000
25%         921.000000
50%        1989.000000
75%        3319.000000
max        5018.000000

Index(['experience', 'job_desig', 'location', 'salary', 'placement_count'], dtype='object')

In [29]:
df.dtypes

experience         object
job_desig          object
location           object
salary             object
placement_count     int64
dtype: object

In [32]:
df.describe(include='all')

       experience  job_desig   location  salary  placement_count
count         105        105        105     105       105.000000
unique         41         19          6       6              NaN
top       2-5 yrs  Analytics  Bengaluru  15to25              NaN
freq           11         54         33      24              NaN
mean          NaN        NaN        NaN     NaN      2183.628571
std           NaN        NaN        NaN     NaN      1374.740222
min           NaN        NaN        NaN     NaN        16.000000
25%           NaN        NaN        NaN     NaN       921.000000
50%           NaN        NaN        NaN     NaN      1989.000000
75%           NaN        NaN        NaN     NaN      3319.000000
max           NaN        NaN        NaN     NaN      5018.000000

In [35]:
print(df[['job_desig']])
print(type(df[['job_desig']]))

     job_desig
0    Analytics
1    Analytics
2       Growth
3    Analytics
4    Analytics
..         ...
100       Data
101  Analytics
102  Analytics
103     Senior
104  Analytics

[105 rows x 1 columns]
<class 'pandas.core.frame.DataFrame'>

In [36]:
print(df['job_desig'])

0      Analytics
1      Analytics
2         Growth
3      Analytics
4      Analytics
         ...
100         Data
101    Analytics
102    Analytics
103       Senior
104    Analytics
Name: job_desig, Length: 105, dtype: object

In [38]:
print(type(df['job_desig']))

<class 'pandas.core.series.Series'>

In [3]:
newco = ['experience','salary']

df1 = df[newco]

df1.head

#print(type(df1))

<bound method NDFrame.head of     experience  salary
0      2-4 yrs   6to10
1     5-10 yrs   6to10
2      3-8 yrs  15to25
3      2-6 yrs   6to10
4      6-8 yrs  25to50
..         ...     ...
100    6-9 yrs  15to25
101    4-8 yrs    3to6
102   8-13 yrs  25to50
103    1-6 yrs  15to25
104    1-3 yrs  10to15

[105 rows x 2 columns]>